Комплексная_автоматизация_2_МОМ_2019.Patch4/src/Documents/ПроизводственнаяОперацияВЕТИС/ПроизводственнаяОперацияВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПроизводственнаяОперацияВЕТИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйствующийСубъект</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ХозяйствующиеСубъектыВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Предприятие</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ПредприятияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DefinedType.ОснованиеПроизводственнаяОперацияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственнойТранзакции</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DefinedType.ИдентификаторПроизводственнойТранзакцииВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершениеПроизводственнойТранзакции</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сырье</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ПродукцияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.СерияНоменклатурыВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВЕТИС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВЕТИС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ЕдиницыИзмеренияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаписьСкладскогоЖурнала</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НизкокачественнаяПродукция</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсобыеОтметки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.СерияНоменклатурыВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ПродукцияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПартии</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВЕТИС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВЕТИС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ЕдиницыИзмеренияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ВетеринарноСопроводительныйДокумент</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ВетеринарноСопроводительныйДокументВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СкоропортящаясяПродукция</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭкспертизаВыполнена</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭкспертизаРезультат</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>EnumRef.РезультатыЛабораторныхИсследованийВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическийПроцесс</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДатаОперацииНачалоПериода</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОперации</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>EnumRef.ТипыПроизводственныхОперацийВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперацииКонецПериода</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Комплексная_автоматизация_2_МОМ_2019.Patch4/src/Documents/ПроизводственнаяОперацияВЕТИС/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТабличнойЧастиТовары

&НаКлиенте
Процедура bt_Patch4_ТоварыНадписьСрокГодностиОбработкаНавигационнойСсылкиВместо(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	bt_Patch4_ОбработатьВводПериода();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура bt_Patch4_ОбработатьВводПериода()
	
	ПоказатьВводЧисла(
	Новый ОписаниеОповещения("bt_Patch4_ОбработатьВводПериодаЗавершение",ЭтотОбъект)
	,7,"Укажите количество дней срока годности",3,0);
	
КонецПроцедуры

&НаКлиенте
Процедура bt_Patch4_ОбработатьВводПериодаЗавершение(Число, Параметры) Экспорт
	
	Если Число <> Неопределено Тогда
		
		СрокГодности = НачалоДня(ТекущаяДата()) + (Число-1)*86400;
		
		МассивСтрок = Элементы.Товары.ВыделенныеСтроки;
	
		Для каждого ТекИдентификатор Из МассивСтрок Цикл
	
			СтрокаТабличнойЧасти = Объект.Товары.НайтиПоИдентификатору(ТекИдентификатор);
	        СтрокаТабличнойЧасти.СрокГодностиНачалоПериода = СрокГодности;
			
	
		КонецЦикла; 
		
    КонецЕсли;

	

КонецПроцедуры // ОбработатьВводПериодаЗавершение()

&НаСервере
Процедура bt_Patch4_ЗаполнитьХозСубъектПослеНаСервере()

	Перем Подразделение;
	Перем Склад;
	Перем Организация;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводствоБезЗаказаВыходныеИзделия.Ссылка.Подразделение КАК Подразделение,
	|	ПроизводствоБезЗаказаВыходныеИзделия.Ссылка.Организация КАК Организация,
	|	ПроизводствоБезЗаказаВыходныеИзделия.Получатель КАК Склад
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказаВыходныеИзделия
	|ГДЕ
	|	ПроизводствоБезЗаказаВыходныеИзделия.Ссылка = &Ссылка
	|	И ПроизводствоБезЗаказаВыходныеИзделия.НомерСтроки = 1";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
		Склад = ВыборкаДетальныеЗаписи.Склад;
		Организация = ВыборкаДетальныеЗаписи.Организация;
		
	КонецЦикла;
	

		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
|	ХозяйствующиеСубъектыВЕТИС.Ссылка КАК ХозяйствующийСубъектВЕТИС
|ПОМЕСТИТЬ ВТХозяйствующиеСубъектыВЕТИС
|ИЗ
|	Справочник.ХозяйствующиеСубъектыВЕТИС КАК ХозяйствующиеСубъектыВЕТИС
|ГДЕ
|	ХозяйствующиеСубъектыВЕТИС.СоответствуетОрганизации = ИСТИНА
|	И ХозяйствующиеСубъектыВЕТИС.Контрагент = &Организация
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ХозяйствующиеСубъектыВЕТИСПредприятия.Предприятие КАК Предприятие,
|	ХозяйствующиеСубъектыВЕТИСПредприятия.ТорговыйОбъект КАК ТорговыйОбъект,
|	ХозяйствующиеСубъектыВЕТИСПредприятия.ПроизводственныйОбъект КАК ПроизводственныйОбъект
|ПОМЕСТИТЬ ВТХозяйствующиеСубъектыВЕТИСПредприятия
|ИЗ
|	Справочник.ХозяйствующиеСубъектыВЕТИС.Предприятия КАК ХозяйствующиеСубъектыВЕТИСПредприятия
|ГДЕ
|	ХозяйствующиеСубъектыВЕТИСПредприятия.Ссылка В
|			(ВЫБРАТЬ
|				ВТХозяйствующиеСубъектыВЕТИС.ХозяйствующийСубъектВЕТИС
|			ИЗ
|				ВТХозяйствующиеСубъектыВЕТИС КАК ВТХозяйствующиеСубъектыВЕТИС)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.Предприятие КАК Предприятие
|ИЗ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия КАК ВТХозяйствующиеСубъектыВЕТИСПредприятия
|ГДЕ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.ТорговыйОбъект = &Склад
|	И ВТХозяйствующиеСубъектыВЕТИСПредприятия.ПроизводственныйОбъект = &Подразделение
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.Предприятие
|ИЗ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия КАК ВТХозяйствующиеСубъектыВЕТИСПредприятия
|ГДЕ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.ПроизводственныйОбъект = &Подразделение
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.Предприятие
|ИЗ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия КАК ВТХозяйствующиеСубъектыВЕТИСПредприятия
|ГДЕ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.ТорговыйОбъект = &Склад
|	И ВТХозяйствующиеСубъектыВЕТИСПредприятия.ПроизводственныйОбъект = &ПустоеПодразделение
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.Предприятие
|ИЗ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия КАК ВТХозяйствующиеСубъектыВЕТИСПредприятия
|ГДЕ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.ТорговыйОбъект = &Склад
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.Предприятие
|ИЗ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия КАК ВТХозяйствующиеСубъектыВЕТИСПредприятия
|ГДЕ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.ТорговыйОбъект = НЕОПРЕДЕЛЕНО
|	И ВТХозяйствующиеСубъектыВЕТИСПредприятия.ПроизводственныйОбъект = &ПустоеПодразделение
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТХозяйствующиеСубъектыВЕТИС.ХозяйствующийСубъектВЕТИС КАК ХозяйствующийСубъектВЕТИС
|ИЗ
|	ВТХозяйствующиеСубъектыВЕТИС КАК ВТХозяйствующиеСубъектыВЕТИС";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ПустоеПодразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	РезультатЗапроса = МассивРезультатов[3];
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда

		Объект.ХозяйствующийСубъект = ВыборкаДетальныеЗаписи.ХозяйствующийСубъектВЕТИС;
		
	КонецЕсли;
	
	РезультатЗапроса = МассивРезультатов[2];
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда

		Объект.Предприятие = ВыборкаДетальныеЗаписи.Предприятие;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура bt_Patch4_ЗаполнитьХозСубъектПосле(Команда)
	bt_Patch4_ЗаполнитьХозСубъектПослеНаСервере();
КонецПроцедуры
